tbobd/certification/test4/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:ClientReferenceNumber>210314135855789#aaas</hot:ClientReferenceNumber>
        <hot:GuestNationality>AE</hot:GuestNationality>
        <hot:Guests>
            <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajaygety</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>28</hot:Age>
            </hot:Guest>
            <hot:Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Lionte</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>27</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="true" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>4388be79-b609-4946-bac0-8492ae16c435</hot:SessionId>
        <hot:NoOfRooms>2</hot:NoOfRooms>
        <hot:ResultIndex>6</hot:ResultIndex>
        <hot:HotelCode>1184045</hot:HotelCode>
        <hot:HotelName>InterContinental Residence Suites Dubai Festival City</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomTypeName>Standard Room</hot:RoomTypeName>
                <hot:RoomTypeCode>CSTGIDU20|1^^CSTGIDU20IDU20</hot:RoomTypeCode>
                <hot:RatePlanCode>CSTGIDU20IDU20</hot:RatePlanCode>
                <hot:RoomRate RoomFare="613.75" Currency="USD" AgentMarkUp="0.00" RoomTax="69.74" TotalFare="683.50"/>
            </hot:HotelRoom>
            <hot:HotelRoom>
                <hot:RoomIndex>2</hot:RoomIndex>
                <hot:RoomTypeName>Standard Room</hot:RoomTypeName>
                <hot:RoomTypeCode>CSTGIDU20|2^^CSTGIDU20IDU20</hot:RoomTypeCode>
                <hot:RatePlanCode>CSTGIDU20IDU20</hot:RatePlanCode>
                <hot:RoomRate RoomFare="613.75" Currency="USD" AgentMarkUp="0.00" RoomTax="69.74" TotalFare="683.50"/>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>